- Droping columns
- Droping rows
- Varoius parameters in dropping functionalities
- Handling missing values by Mean,Median and Mode (Imputer)

In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('PS3').getOrCreate()

In [2]:
spark

In [4]:
df= spark.read.csv('ps3.csv',header=True,inferSchema=True)
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
|   null|  30|      null|  null|
+-------+----+----------+------+

In [5]:
#drop column

df.drop('Name').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  34|         9| 20000|
|  21|         4| 44000|
|  24|        10| 60000|
|  27|         5| 15000|
|  43|         8| 50000|
|  38|         2| 45000|
|null|      null| 70000|
|  25|        10| 25000|
|  30|      null|  null|
+----+----------+------+

In [6]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
|   null|  30|      null|  null|
+-------+----+----------+------+

In [7]:
df.na.drop().show()   #delete all null rows

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Fred| 34|         9| 20000|
|  Jack| 21|         4| 44000|
|Arevan| 24|        10| 60000|
|  Cara| 27|         5| 15000|
| Ethan| 43|         8| 50000|
|  Mary| 38|         2| 45000|
+------+---+----------+------+

In [8]:
# any==how
df.na.drop(how="all").show()  #how=all  if row all null

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
|   null|  30|      null|  null|
+-------+----+----------+------+

In [9]:
df.na.drop(how="any").show()  #how=any  any null row

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Fred| 34|         9| 20000|
|  Jack| 21|         4| 44000|
|Arevan| 24|        10| 60000|
|  Cara| 27|         5| 15000|
| Ethan| 43|         8| 50000|
|  Mary| 38|         2| 45000|
+------+---+----------+------+

In [10]:
df.na.drop(how="any",thresh=2).show()  #at least 2 null value can have others drop

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
+-------+----+----------+------+

In [11]:
df.na.drop(how="any",thresh=1).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
|   null|  30|      null|  null|
+-------+----+----------+------+

In [12]:
#subset

df.na.drop(how="any",subset=['Experience']).show()  # if subset column have null that row drop

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
|  Fred| 34|         9| 20000|
|  Jack| 21|         4| 44000|
|Arevan| 24|        10| 60000|
|  Cara| 27|         5| 15000|
| Ethan| 43|         8| 50000|
|  Mary| 38|         2| 45000|
|  null| 25|        10| 25000|
+------+---+----------+------+

In [18]:
#Fill the missing values

df.na.fill('Missing Values').show()   #only string

+--------------+----+----------+------+
|          Name| Age|Experience|Salary|
+--------------+----+----------+------+
|          Fred|  34|         9| 20000|
|          Jack|  21|         4| 44000|
|        Arevan|  24|        10| 60000|
|          Cara|  27|         5| 15000|
|         Ethan|  43|         8| 50000|
|          Mary|  38|         2| 45000|
|       Richard|null|      null| 70000|
|Missing Values|  25|        10| 25000|
|Missing Values|  30|      null|  null|
+--------------+----+----------+------+

In [19]:
df.na.fill(0).show()  #only integers

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|   Fred| 34|         9| 20000|
|   Jack| 21|         4| 44000|
| Arevan| 24|        10| 60000|
|   Cara| 27|         5| 15000|
|  Ethan| 43|         8| 50000|
|   Mary| 38|         2| 45000|
|Richard|  0|         0| 70000|
|   null| 25|        10| 25000|
|   null| 30|         0|     0|
+-------+---+----------+------+

In [23]:
df.na.fill(0,'Experience').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|         0| 70000|
|   null|  25|        10| 25000|
|   null|  30|         0|  null|
+-------+----+----------+------+

In [24]:
df.na.fill(0,['Experience','Salary']).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|         0| 70000|
|   null|  25|        10| 25000|
|   null|  30|         0|     0|
+-------+----+----------+------+

In [ ]:
#----------------------------Imputed Values

In [25]:
df.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|   Fred|  34|         9| 20000|
|   Jack|  21|         4| 44000|
| Arevan|  24|        10| 60000|
|   Cara|  27|         5| 15000|
|  Ethan|  43|         8| 50000|
|   Mary|  38|         2| 45000|
|Richard|null|      null| 70000|
|   null|  25|        10| 25000|
|   null|  30|      null|  null|
+-------+----+----------+------+

In [26]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
).setStrategy("mean")

In [27]:
# add imputation cols to df

imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|   Fred|  34|         9| 20000|         34|                 9|         20000|
|   Jack|  21|         4| 44000|         21|                 4|         44000|
| Arevan|  24|        10| 60000|         24|                10|         60000|
|   Cara|  27|         5| 15000|         27|                 5|         15000|
|  Ethan|  43|         8| 50000|         43|                 8|         50000|
|   Mary|  38|         2| 45000|         38|                 2|         45000|
|Richard|null|      null| 70000|         30|                 6|         70000|
|   null|  25|        10| 25000|         25|                10|         25000|
|   null|  30|      null|  null|         30|                 6|         41125|
+-------+----+----------+------+-----------+------------------+--------------+

In [28]:
#meadin imputer

from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['Age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['Age','Experience','Salary']]
).setStrategy("median")

imputer.fit(df).transform(df).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|   Fred|  34|         9| 20000|         34|                 9|         20000|
|   Jack|  21|         4| 44000|         21|                 4|         44000|
| Arevan|  24|        10| 60000|         24|                10|         60000|
|   Cara|  27|         5| 15000|         27|                 5|         15000|
|  Ethan|  43|         8| 50000|         43|                 8|         50000|
|   Mary|  38|         2| 45000|         38|                 2|         45000|
|Richard|null|      null| 70000|         27|                 8|         70000|
|   null|  25|        10| 25000|         25|                10|         25000|
|   null|  30|      null|  null|         30|                 8|         44000|
+-------+----+----------+------+-----------+------------------+--------------+